Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F16C.tmx
Source language: en_us
Languages: zh_cn

source: The Hidden Reason We Need Friendships
zh_cn: 我们需要友谊的深层次原因

source: Have you ever noticed it's often much easier to be yourself around your friends as opposed to your family or your spouse?
zh_cn: 你是否注意到，你在家人，配偶面前没有比在朋友面前自在。

source: In some ways this is strange, as friendships are usually considered more casual relationships than marriage or family.
zh_cn: 在某种程度来说，这很奇怪，因为友谊通常认识是比婚姻或者家庭关系而言更随意的关系。

source: Shouldn't it be the case that the more committed and "serious" the relationship is, the more you can really reveal your true self?
zh_cn: 难道不是在更认真更投入的关系中，你才能真正的展现自我吗？

source: Not necessarily.
zh_cn: 不完全是这样的。

source: Beyond the reasons we know, friendships are incredibly important.
zh_cn: 除了我们知道的原因，友谊是真的难以置信的重要。

source: They provide emotional support, social integration, and opportunities for fun and play.
zh_cn: 友谊提供情感支持，社会交际， 友谊也使得人们有机会得以玩耍享乐。

source: Friendship has a unique aspect that makes it especially good for honest, natural interaction. Friends don't see their destinies as intertwined with your own.
zh_cn: 朋友们认为命运各不独立，互不纠缠，正是这样一种特性，使得人们坦诚自然的交往。

source: In other words, it's the fact that we're less "wrapped up" in our friends - and our friends are less "wrapped up" in us - that allows for honest and easy discourse.
zh_cn: 换句话说， 我们在朋友面前防备少了， 朋友们在我们面前也是这样，这才造就了坦诚简单的友谊。

source: A friend doesn't see her identity as dependent on the choices you make.
zh_cn: 一位朋友不认为她的身份不由于你的选择决定的。

source: Even a best friend knows that you are two different people, with two different paths in life.
zh_cn: 即使是最好的朋友也知道你俩是不同的人，有不同的人生轨迹。

source: She doesn't feel like her future is based on what you do today, allowing you to be fully yourself in the moment.
zh_cn: 她不认为他的未来基于你的现在，所以在她面前你会展现真的的自己。

source: Let's look at this compared to romantic relationships.
zh_cn: 在恋爱关系比较之后，我们再来做另一番探究。

source: We know that married couples almost always see their destinies as intertwined with one another.
zh_cn: 我们都知道，已婚夫妇几乎都认为他们的命运与伴侣相互牵连。

source: Typically speaking, where one spouse wants to live in the future inherently effects where the other person will live.
zh_cn: 这也就是说，其中一方想要过什么样的生活与另一方的未来息息相关。

source: One spouse wanting (or not wanting) to have children in the future effects whether the other person will end up having children.
zh_cn: 一方想要或者不想要小孩，决定了另一方是否会有小孩。

source: Intertwined destinies, in some ways, is the whole point of marriage.
zh_cn: 从某种程度而言，相互纠缠的命运是婚姻的全部意义。

source: But even in casual dating relationships, it's already harder to be completely yourself with a boyfriend or girlfriend than it is with a friend.
zh_cn: 但即使是在普通的恋爱关系中，在你的男朋友或者女朋友面前，你也很难在朋友面前那般自如。

source: This is because there's always the potential to intertwine your destinies.
zh_cn: 这是因为你们的命运有相互纠缠的可能。

source: You may, at some point, want to combine your life paths¡­ and this possibility often lends itself to less easy interactions.
zh_cn: 在某个时间，你可能会想要你俩的人生轨迹并行。

source: No one ever prompts a friend to "define the relationship."
zh_cn: 这种可能使得你们之间的交往不那么随意。

source: No one ever asks a friend, "Where is this going?"
zh_cn: 不会有人这样问他的朋友，我们的未来是怎样？

source: When it comes to family, there tend to be a lot of expectations that simply don't exist (or don't exist nearly as intensely) within friendships.
zh_cn: 每提及到家庭，总会有很多期望，这不同于友谊。

source: Your family may expect you to do well in life simply to reflect well upon them.
zh_cn: 你的家庭希望你的生活顺利，是考虑到他们自己。

source: By contract, what you do with your life does not reflect upon your friends in the same way it may reflect upon your family.
zh_cn: 相反，你的人生不会像影响你的那样影响到你的朋友。
